#ifndef HAL_CLOCK_HEADER_CLOCK_PRIVATE_H_
#define HAL_CLOCK_HEADER_CLOCK_PRIVATE_H_

/* Using register files
union{
	struct LEDs_B_Bits_t{
		u8 LED8 	:  1; //B0
		u8 LED9 	:  1; //B1
		u8 LED10 	:  1; //B2
		u8 LED11 	:  1; //B3
		u8 LED12 	:  1; //B4
		u8 LED13 	:  1; //B5
		u8 LED14	:  1; //B6
		u8 LED15 	:  1; //B7
	}LEDs_B_Bits_t;
	u8 LEDs_B_REG;
}LEDs_B_u;

union{
	struct LEDs_A_Bits_t{
		u8 LED7 	:  1; //A0
		u8 LED6 	:  1; //A1
		u8 LED5 	:  1; //A2
		u8 LED4 	:  1; //A3
		u8 LED3 	:  1; //A4
		u8 LED2 	:  1; //A5
		u8 LED1		:  1; //A6
		u8 Empty	:  1; //A7
	}LEDs_A_Bits_t;
	u8 LEDs_A_REG;
}LEDs_A_u;
 */

#define TOTAL_CYCLE_POINTS	300
#define MINUTES_POINT		5
#define HOURS_POINT			25

#define MINI_ZERO	0xF8,0x88,0x88,0x88,0xF8
#define	MINI_ONE	0x00,0x00,0x00,0xF8,0xF8
#define MINI_TWO	0xB8,0xA8,0xA8,0xA8,0xE8
#define MINI_THREE	0xA8,0xA8,0xA8,0xA8,0xF8
#define MINI_FOUR	0xE0,0x20,0x20,0x20,0xF8
#define MINI_FIVE	0xE8,0xA8,0xA8,0xA8,0xB8
#define MINI_SIX	0xF8,0xA8,0xA8,0xA8,0xB8
#define MINI_SEVEN	0x80,0x80,0x80,0x80,0xF8
#define MINI_EIGHT	0xF8,0xA8,0xA8,0xA8,0xF8
#define MINI_NINE	0xE8,0xA8,0xA8,0xA8,0xF8

#define ZERO	0xFF,0x81,0x81,0x81,0x81,0x81,0x81,0x81,0x81,0x81,0xFF
#define	ONE		0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0xFF
#define TWO		0x9F,0x91,0x91,0x91,0x91,0x91,0x91,0x91,0x91,0x91,0xF1
#define THREE	0x91,0x91,0x91,0x91,0x91,0x91,0x91,0x91,0x91,0x91,0xFF
#define FOUR	0xF0,0x10,0x10,0x10,0x10,0x10,0x10,0x10,0x10,0x10,0xFF
#define FIVE	0xF1,0x91,0x91,0x91,0x91,0x91,0x91,0x91,0x91,0x91,0x9F
#define SIX		0xFF,0x91,0x91,0x91,0x91,0x91,0x91,0x91,0x91,0x91,0x9F
#define SEVEN	0x80,0x80,0x80,0x80,0x80,0x80,0x80,0x80,0x80,0x80,0xFF
#define EIGHT	0xFF,0x91,0x91,0x91,0x91,0x91,0x91,0x91,0x91,0x91,0xFF
#define NINE	0xF1,0x91,0x91,0x91,0x91,0x91,0x91,0x91,0x91,0x91,0xFF

#define LETTER_MINI_I	0x88,0x88,0x88,0xF8,0x88,0x88,0x88
#define	LETTER_MINI_M	0xF8,0x10,0x20,0x40,0x20,0x10,0xF8
#define LETTER_MINI_T	0x08,0x08,0x08,0xF8,0x08,0x08,0x08

#define LETTER_I 0x81,0x81,0x81,0x81,0x81,0xFF,0x81,0x81,0x81,0x81,0x81
#define	LETTER_M 0xFF,0x01,0x02,0x04,0x08,0x10,0x08,0x04,0x02,0x01,0xFF
#define LETTER_T 0x01,0x01,0x01,0x01,0x01,0xFF,0x01,0x01,0x01,0x01,0x01

#if F_CPU >= 16000000
#define DESIRED_COUNTER_VALUE		250UL //250 for each second (250 * (256/16)us * 250 = 1 second)
#elif F_CPU >= 8000000
#define DESIRED_COUNTER_VALUE		125UL //125 for each second (125 * (256/8)us * 250 = 1 second)
#endif

#define TIMER2_CTC_VALUE 			8000UL
#define RESET_TIMER_TOLERANCE 		125UL
#endif /* HAL_CLOCK_HEADER_CLOCK_PRIVATE_H_ */
